0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-3.784 0 0);

boundaryField
{
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform (-3.784 0 0);
    }
    
    outlet
    {
        type            outletPhaseMeanVelocity;
        Umean           3.784;
        alpha           alpha.water;
        value           uniform (-3.784 0 0);
    }
    Sym_bottom
    {
        type            symmetryPlane;
    }
    Sym_midPlane
    {
        type            symmetryPlane;
    }
    Sym_side
    {
        type            symmetryPlane;
    }
    Carena
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
