constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs (rigidBodyMeshMotion);

motionSolver    rigidBodyMotion;

report          on;

/*
// How often to refine
refineInterval	1;

// Field to be refined
field		alpha.water;

// Refine field inbetween lower..upper
lowerRefineLevel	0.001;
upperRefineLevel	0.999;

// If value < unrefineLevel unrefine
unrefineLevel	10;

// Have slower than 2:1 refinement
nBufferLayers	1;

// Refine cells only up to maxRefinement levels
maxRefinement	3;

// Stop refinement if maxCells reached
maxCells	200000;

// Flux field and corresponding velocity field. Fluxes on changed
// faces get recalculated by interpolating the velocity. Use 'none'
// on surfaceScalarFields that do not need to be reinterpolated.
correctFluxes
(
    (phi none)
    (nHatf none)
    (rhoPhi none)
    (alphaPhi0.water none)
    (ghf none)
    (alphaPhiUn none)
);

// Write the refinement level as a volScalarField
dumpLevel	true;

*/

solver
{
    type Newmark;
}

accelerationRelaxation table
			(
			(0	0)
			(10	0)
			(20	0.15)
			(50	0.3)
			(100	0.3)
			);

bodies
{
    Carena
    {
        type            rigidBody;
        parent          root;

        centreOfMass    (0 0 0);
        mass            14525;
        inertia         (40 0 0 262400 0 262400);
        
        transform       (1 0 0 0 1 0 0 0 1) (5.37 0 0.5);

        joint
        {
            type    composite;
            joints
            (
                {
                    type Pz;
                }
                {
                    type Ry;
                }
            );
        }

        patches         (Carena);
        innerDistance   1;
        outerDistance   5;
    }
}

constraints
{
    zAxis
    {
        rigidBodyMotionConstraint line;
        direction     (0 0 1);
    }

    yPlane
    {
        rigidBodyMotionConstraint axis;
        axis          (0 1 0);
    }
}

restraints
{
    translationDamper
    {
        type linearDamper;
        body Carena;
        coeff 8596;
    }

    rotationDamper
    {
        type sphericalAngularDamper;
        body Carena;
        coeff 11586;
    }
}


// ************************************************************************* //
