system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1.0;

// Variables

L1 42.5;
L2 -93.5;
B1 52.5;
B2 0;
D1 -52.5;
D2 26.25;

vertices
(
    	($L2 0 $D1)
	($L1 0 $D1) 
	($L1 $B1 $D1)
	($L2 $B1 $D1)

	( $L2 $B2  $D2)    	 
    	( $L1 $B2  $D2) 
	( $L1  $B1  $D2)
	( $L2  $B1  $D2)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 24 18) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    atmosphere 
    {
        type patch;
        faces
        (
           (4 5 6 7)
        );
    }

    inlet 
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    outlet 
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    Sym_bottom 
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }

    Sym_midPlane
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
        );
    }

    Sym_side
    {
        type symmetryPlane;
        faces
        (
            (2 3 7 6)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
