system/blockMeshDict_multi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1.0;

// Variables

L1 42.5;
L2 -93.5;
B1 52.5;
B2 0;
D1 -52.5;
D2 26.25;

//Free surface
zft 0.8;
zfb -0.8;

zft2 1.4;
zfb2 -1.4;

vertices
(
    	($L2 $B2 $D1)
	($L1 $B2 $D1) 
	($L1 $B1 $D1)
	($L2 $B1 $D1)

    	($L2 $B2 $zfb2)
	($L1 $B2 $zfb2) 
	($L1 $B1 $zfb2)
	($L2 $B1 $zfb2)

    	($L2 $B2 $zfb)
	($L1 $B2 $zfb) 
	($L1 $B1 $zfb)
	($L2 $B1 $zfb)

    	($L2 $B2 $zft)
	($L1 $B2 $zft) 
	($L1 $B1 $zft)
	($L2 $B1 $zft)

    	($L2 $B2 $zft2)
	($L1 $B2 $zft2) 
	($L1 $B1 $zft2)
	($L2 $B1 $zft2)

	( $L2 $B2  $D2)    	 
    	( $L1 $B2  $D2) 
	( $L1  $B1  $D2)
	( $L2  $B1  $D2)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 30 60) simpleGrading (1 1 0.25)
    hex (4 5 6 7 8 9 10 11) (40 30 10) simpleGrading (1 1 0.5)
    hex (8 9 10 11 12 13 14 15) (40 30 20) simpleGrading (1 1 1)
    hex (12 13 14 15 16 17 18 19) (40 30 10) simpleGrading (1 1 2)
    hex (16 17 18 19 20 21 22 23) (40 30 20) simpleGrading (1 1 4)
);

edges
(
);

boundary
(
    atmosphere 
    {
        type patch;
        faces
        (
           (20 21 22 23)
        );
    }

    inlet 
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
            (9 10 14 13)
            (13 14 18 17)
            (117 18 22 21)
        );
    }

    outlet 
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
            (8 12 15 11)
            (12 16 19 15)
            (16 20 23 19)
        );
    }

    Sym_bottom 
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }

    Sym_midPlane
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
        );
    }

    Sym_side
    {
        type symmetryPlane;
        faces
        (
            (2 3 7 6)
            (6 7 11 10)
            (10 11 15 14)
            (14 15 19 18)
            (18 19 23 22)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
