system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         100;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii; //binary;

writePrecision  6;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           10;
maxAlphaCo      5;
maxDeltaT       0.022;
 
functions
{
	forces
	{
	type forces;
	libs ("libforces.so");
	patches ("Carena");
	pName p;
	UName U;
	log true;
	rhoName rho;
	rhoInf 1025; // Reference density, fluid
	CofR (5.87 0 0.5); // Origin for moment calculations
	writeControl timeStep;
	writeInterval 1;
	}
};

// ************************************************************************* //
