system/topoSetDict.3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "initialConditions"

actions
(
    {
        name    c0;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (#calc "($c1 * 0.55 * $Lpp)" #calc "($c4 * -0.55 * $Lpp)" #calc "($c3 * 0.55 * $Lpp)") (#calc "($c2 * 0.55 * $Lpp)" #calc "($c4 * 0.55 * $Lpp)" #calc "($c2 * 0.55 * $Lpp)");
        }
    }
);

// ************************************************************************* //
